In [1]:
import pandas as pd

In [2]:
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)

In [3]:
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [4]:
df['Edad_en_10_años'] = df['Edad'] + 10
df

   Nombre  Edad     Ciudad  Edad_en_10_años
0     Ana    25     Madrid               35
1    Luis    30  Barcelona               40
2  Carlos    22   Valencia               32
3    Sara    27     Bilbao               37

In [5]:
df['Ciudad'] = df['Ciudad'].str.upper()
df

   Nombre  Edad     Ciudad  Edad_en_10_años
0     Ana    25     MADRID               35
1    Luis    30  BARCELONA               40
2  Carlos    22   VALENCIA               32
3    Sara    27     BILBAO               37

In [7]:
df['Es_Mayor_de_25'] = df['Edad'] => 25
df

   Nombre  Edad     Ciudad  Edad_en_10_años  Es_Mayor_de_25
0     Ana    25     MADRID               35           False
1    Luis    30  BARCELONA               40            True
2  Carlos    22   VALENCIA               32           False
3    Sara    27     BILBAO               37            True